{"unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "max_len": 512, "special_tokens_map_file": "/Users/sushrutmujumdar/.cache/torch/transformers/b59dcf6ae76384281f5fd34a218b63dbaded7aca1075729835b8f5ce324f6d6b.275045728fbf41c11d3dae08b8742c054377e18d92cc7b72b6351152a99b64e4", "tokenizer_file": null, "name_or_path": "nlptown/bert-base-multilingual-uncased-sentiment"}